<?xml version="1.0" encoding="iso-8859-1"?>
<rss version="2.0"><channel><title>知泉-blog</title><link>http://localhost:8888</link><description></description><lastBuildDate>Sun, 07 Jul 2013 01:35:05 GMT</lastBuildDate><generator>PyRSS2Gen-1.1.0</generator><docs>http://blogs.law.harvard.edu/tech/rss</docs><item><title>Education</title><link>http://localhost:8888/article/2013-03-10-education</link><description>&lt;p&gt;Education, Education, &#20986;&#36335;&#12290;&#36817;&#26085;&#65292;&#22312;&#20248;&#37239;&#35266;&#30475;&#20102;&#12298;&#25105;&#20204;&#20026;&#20160;&#20040;&#36139;&#31351;&#31995;&#21015;&#12299;&#20043;&#20013;&#22269;&#31687;&#12290;
&#25105;&#30340;&#35266;&#21518;&#24863;&#26159;&#65306;&#26377;&#28385;&#22068;&#30340;&#35805;&#35201;&#35828;&#65292;&#24453;&#21040;&#22068;&#36793;&#65292;&#21364;&#19968;&#21477;&#20063;&#36454;&#19981;&#20986;&#26469;&#12290;&#24433;&#29255;&#20174;&#19977;&#20010;&#35270;&#35282;&#36879;&#35270;&#20102;&#20013;&#22269;&#36817;&#21313;&#24180;&#26469;&#25945;&#32946;&#20135;&#19994;&#21270;&#30340;&#26411;&#31471;&#12290;
&#19968;&#20010;&#32844;&#19994;&#23398;&#26657;&#25307;&#29983;&#32769;&#24072;&#30340;&#33258;&#36848;&#65292; &#19968;&#20010;&#22823;&#22235;&#27605;&#19994;&#29983;&#25214;&#24037;&#20316;&#30340;&#25504;&#24433;&#65292;&#19968;&#20010;&#39640;&#32771;&#33853;&#27036;&#21518;&#20892;&#26449;&#22899;&#29983;&#30340;&#24999;&#25004;&#65292;&#19977;&#20010;&#20154;&#20687;&#20116;&#32447;&#35889;&#19978;&#36339;&#21160;&#30340;&#38899;&#31526;&#65292;
&#24464;&#24464;&#23637;&#24320;&#65292;&#40092;&#27963;&#22320;&#36339;&#21160;&#30528;&#65292;&#29301;&#24341;&#30528;&#36825;&#26465;&#20135;&#19994;&#38142;&#30340;&#27599;&#19968;&#20010;&#29615;&#33410;&#65292;&#26500;&#25104;&#19968;&#24133;&#26665;&#26665;&#22914;&#29983;&#30340;&#20048;&#31456;&#65292;&#35753;&#20154;&#35302;&#30446;&#24778;&#24515;&#12290;&#24433;&#29255;&#20013;&#32844;&#19994;&#23398;&#26657;&#30340;&#25945;&#24072;&#65292;
&#26126;&#26174;&#22320;&#22312;&#25511;&#35785;&#30528;&#65292;&#32780;&#22823;&#22235;&#27605;&#19994;&#30340;&#30007;&#23401;&#22312;&#30171;&#33510;&#22320;&#25379;&#25166;&#30528;&#65292;&#39640;&#32771;&#21518;&#30340;&#20892;&#23478;&#22899;&#23401;&#19981;&#30693;&#36947;&#26410;&#26469;&#26159;&#20160;&#20040;&#65292;&#30460;&#26395;&#30528;&#12290;&#19968;&#20999;&#28129;&#28129;&#30340;&#22312;&#38236;&#22836;&#19979;&#21576;&#29616;&#30528;&#65292;&#21453;&#26144;&#30528;&#19968;&#20010;&#26102;&#20195;&#36716;&#22411;&#30340;&#30171;&#33510;&#12290;&lt;/p&gt;
&lt;p&gt;&#20154;&#26159;&#19981;&#24179;&#31561;&#30340;&#65292;&#26377;&#40644;&#31181;&#12289;&#30333;&#31181;&#12289;&#40657;&#31181;&#20154;&#65292;&#21487;&#20197;&#22312;&#19981;&#21516;&#30340;&#22269;&#24230;&#65292;&#19981;&#21516;&#30340;&#22478;&#24066;&#20986;&#29983;&#65292;&#20986;&#29983;&#22312;&#32445;&#32422;&#65292;&#26159;&#32445;&#32422;&#20154;&#65292;&#20986;&#29983;&#24052;&#40654;&#65292;&#26159;&#24052;&#40654;&#20154;&#65292;&#20986;&#29983;&#22312;&#20013;&#22269;&#20892;&#26449;&#65292;&#23601;&#26159;&#20892;&#26449;&#20154;&#65292;
&#26412;&#26080;&#25152;&#35859;&#22909;&#22351;&#65292;&#26080;&#25152;&#35859;&#20248;&#33391;&#65292;&#22312;&#27861;&#24459;&#12289;&#21046;&#24230;&#38754;&#21069;&#20154;&#20154;&#37117;&#26159;&#24179;&#31561;&#30340;&#12290;&#36825;&#26159;&#25105;&#22312;&#30005;&#24433;&#12298;&#26519;&#32943;&#12299;&#20013;&#21548;&#21040;&#30340;&#65292;19&#19990;&#32426;&#20013;&#26399;&#30340;&#32654;&#22269;&#29190;&#21457;&#20102;&#21335;&#21271;&#25112;&#20105;&#65292;&#24223;&#38500;&#20102;&#20892;&#22900;&#21046;&#65292;
&#25581;&#24320;&#20102;&#20154;&#31867;&#21382;&#21490;&#21457;&#23637;&#30340;&#26032;&#31687;&#31456;&#12290;&lt;/p&gt;
&lt;p&gt;&#8220;&#19975;&#33324;&#30342;&#19979;&#21697;&#65292;&#21807;&#26377;&#35835;&#20070;&#39640;&#12290;&#8221; &#25945;&#32946;&#65292;&#22312;&#20256;&#32479;&#20013;&#22269;&#31038;&#20250;&#65292;&#26159;&#31232;&#32570;&#31934;&#36149;&#30340;&#36164;&#28304;&#65292;&#26159;&#19979;&#23618;&#31038;&#20250;&#27969;&#21521;&#19978;&#23618;&#31038;&#20250;&#30340;&#31649;&#36947;&#65292;&#24310;&#32493;&#20102;&#20960;&#21315;&#24180;&#65292;&#30452;&#21040;&#20135;&#19994;&#21270;&#65292;
&#26377;&#20102;&#31934;&#33521;&#25945;&#32946;&#65292;&#22823;&#20247;&#25945;&#32946;&#65292;&#29978;&#33267;&#25945;&#32946;&#21830;&#21697;&#65292;&#21487;&#22856;&#30340;&#20154;&#65292;&#24635;&#36824;&#20197;&#20026;&#21482;&#35201;&#26159;&#25945;&#32946;&#65292;&#23601;&#36824;&#26159;&#31934;&#33521;&#25945;&#32946;&#65292;&#19981;&#36807;&#65292;&#21487;&#22856;&#30340;&#20154;&#65292;&#20063;&#21482;&#33021;&#26159;&#36825;&#26679;&#20102;&#12290;
&#25945;&#32946;&#36164;&#28304;&#65292;&#25945;&#32946;&#36136;&#37327;&#30340;&#19981;&#22343;&#31561;&#20998;&#24067;&#65292;&#20351;&#8220;&#40857;&#29983;&#40857;&#65292;&#20964;&#29983;&#20964;&#65292;&#32769;&#40736;&#29983;&#20799;&#20250;&#25171;&#27934;&#12290;&#8221;&#30340;&#35866;&#35821;&#21457;&#29983;&#30340;&#21487;&#33021;&#24615;&#22686;&#21152;&#12290;&#22312;&#26102;&#20195;&#36716;&#22411;&#20013;&#65292;&#20256;&#32479;&#25991;&#21270;&#65292;&#22312;&#21672;&#35810;&#19981;&#21457;&#36798;&#65292;
&#38754;&#26397;&#40644;&#22303;&#32972;&#26397;&#22825;&#30340;&#20154;&#27665;&#38754;&#21069;&#65292;&#24448;&#24448;&#25198;&#28436;&#20102;&#19968;&#20010;&#27450;&#39575;&#32773;&#30340;&#35282;&#33394;&#65292;&#32780;&#19988;&#23427;&#39575;&#24471;&#26159;&#37027;&#20040;&#33258;&#28982;&#65292;&#20063;&#35768;&#26377;&#19968;&#22825;&#65292;&#23427;&#20063;&#20250;&#34987;&#32972;&#24323;&#65292;&#24443;&#24213;&#30340;&#32972;&#24323;&#12290;&lt;/p&gt;
&lt;p&gt;&#20154;&#31867;&#31038;&#20250;&#21457;&#23637;&#65292;&#20154;&#21475;&#36880;&#28176;&#38598;&#20013;&#65292;&#26377;&#38646;&#25955;&#30340;&#20892;&#26449;&#21521;&#22478;&#38215;&#38598;&#20013;&#65292;&#30001;&#20892;&#19994;&#20026;&#20027;&#32463;&#27982;&#24418;&#24335;&#36827;&#21270;&#21040;&#20197;&#24037;&#19994;&#12289;&#26381;&#21153;&#20063;&#20026;&#20027;&#30340;&#31038;&#20250;&#12290;
&#22312;&#25243;&#24323;&#23665;&#37326;&#65292;&#20892;&#30000;&#65292;&#32789;&#20316;&#30340;&#36827;&#22478;&#30340;&#21516;&#26102;&#65292;&#33021;&#19981;&#33021;&#26377;&#19968;&#31181;&#26356;&#21152;&#25991;&#26126;&#30340;&#26041;&#24335;&#65292;&#20351;&#31163;&#24320;&#25925;&#22303;&#30340;&#20154;&#20204;&#23569;&#20123;&#30171;&#26970;&#65292;&#25110;&#32773;&#65292;&#25105;&#20204;&#26377;&#27809;&#26377;&#19968;&#31181;&#21046;&#24230;&#65292;
&#26377;&#27809;&#26377;&#19968;&#31181;&#29983;&#27963;&#26041;&#24335;&#65292;&#26377;&#27809;&#26377;&#19968;&#31181;&#24037;&#20316;&#26041;&#24335;&#65292;&#26377;&#27809;&#26377;&#19968;&#31181;&#31185;&#25216;&#65292;&#20351;&#31163;&#24320;&#30340;&#20154;&#20204;&#24895;&#24847;&#22238;&#21040;&#23478;&#20065;&#65292;&#24518;&#21450;&#23478;&#20065;&#12290;&#26366;&#32463;&#26377;&#19968;&#21516;&#23398;&#65292;
&#25105;&#38382;&#65292;&#27605;&#19994;&#21518;&#26377;&#22238;&#23478;&#21457;&#23637;&#30340;&#21487;&#33021;&#20040;&#65292;&#20182;&#35828;&#65292;&#23478;&#37324;&#37027;&#36793;&#22826;&#24179;&#31351;&#20102;&#65292;&#27809;&#20160;&#20040;&#22909;&#30340;&#12290;&#32780;&#29616;&#22312;&#65292;&#25105;&#24819;&#34917;&#20805;&#36947;&#65292;&#24453;&#23567;&#26377;&#25152;&#25104;&#65292;
&#24895;&#24847;&#22238;&#23478;&#20065;&#20570;&#20986;&#36129;&#29486;&#20040;&#65311;&#26366;&#32463;&#26377;&#19968;&#21516;&#20107;&#35828;&#36947;&#65292;&#20154;&#23478;&#26159;&#26477;&#20108;&#20195;&#65292;&#25105;&#20204;&#26159;&#26477;&#19968;&#20195;&#65292;&#33021;&#27604;&#20040;&#65292;&#24403;&#28982;&#35201;&#20184;&#20986;&#22810;&#12290;&#24076;&#26395;&#22312;21&#19990;&#32426;&#30340;&#20170;&#22825;&#65292;
&#19981;&#35201;&#26377;&#20154;&#31867;&#24037;&#19994;&#38761;&#21629;&#21021;&#26399;&#30340;&#33521;&#22269;&#32650;&#21507;&#20154;&#33324;&#30340;&#24754;&#20652;&#21382;&#21490;&#20107;&#23454;&#21457;&#29983;&#12290;&#21448;&#26377;&#35841;&#35828;&#65292;&#25105;&#20204;&#36825;&#26679;&#22478;&#38215;&#21270;&#30340;&#29983;&#27963;&#26159;&#32654;&#22909;&#30340;&#65292;&#27491;&#30830;&#30340;&#65292;
&#32780;&#20892;&#26449;&#29983;&#27963;&#26159;&#19968;&#23450;&#36139;&#33510;&#30340;&#65292;&#33853;&#21518;&#30340;&#65292;&#20852;&#35768;&#30495;&#30340;&#26377;&#37027;&#20040;&#19968;&#22825;&#65292;&#36825;&#26679;&#20107;&#23454;&#20250;&#21457;&#29983;&#12290;&lt;/p&gt;
&lt;p&gt;&#20960;&#30334;&#24180;&#21069;&#65292;&#20063;&#35768;&#20960;&#21315;&#24180;&#21069;&#65292;&#26159;&#36867;&#36991;&#25112;&#20081;&#39269;&#33618;&#20063;&#22909;&#65292;&#26159;&#36864;&#36991;&#24217;&#22530;&#24402;&#38544;&#23665;&#26519;&#20063;&#22909;&#65292;&#36824;&#26159;&#23500;&#23478;&#19968;&#26102;&#20030;&#23478;&#36801;&#31227;&#20063;&#22909;&#65292;&#24635;&#20043;&#65292;&#31163;&#24320;&#22478;&#24066;&#65292;
&#26469;&#21040;&#36825;&#37324;&#65292;&#36873;&#20013;&#20102;&#36825;&#20010;&#22320;&#26041;&#65292;&#30422;&#36215;&#20102;&#31072;&#22530;&#65292;&#20379;&#22857;&#19978;&#31062;&#23447;&#65292;&#32493;&#36215;&#23478;&#35889;&#65292;&#24320;&#33618;&#31181;&#22320;&#65292;&#24341;&#28192;&#28748;&#28297;&#65292;&#32780;&#20170;&#65292;&#20182;&#20204;&#30340;&#23376;&#23376;&#23385;&#23385;&#20204;&#65292;
&#32972;&#36215;&#34892;&#22218;&#65292;&#25918;&#19979;&#35044;&#33151;&#65292;&#25243;&#24320;&#38148;&#22836;&#65292;&#22238;&#27969;&#22478;&#24066;&#65292;&#36825;&#26159;&#32321;&#34893;&#65292;&#20284;&#20046;&#19982;&#20197;&#21069;&#27809;&#20160;&#20040;&#19981;&#21516;&#12290;&lt;/p&gt;
&lt;p&gt;&#35753;&#20154;&#19990;&#20195;&#30456;&#20449;&#30340;&#65292;&#24635;&#35201;&#35201;&#20154;&#19968;&#30452;&#30456;&#20449;&#19979;&#21435;&#65307;&#35753;&#20154;&#23401;&#25552;&#26102;&#29980;&#32654;&#30340;&#65292;&#24635;&#35201;&#35201;&#20154;&#19968;&#19990;&#29980;&#32654;&#19979;&#21435;&#65307;&#20449;&#20208;&#65292;&#25925;&#20065;&#65292;&#19981;&#35201;&#25903;&#31163;&#30772;&#30862;&#65292;&#24635;&#35201;&#30041;&#28857;&#32654;&#22909;&#30340;&#65292;&#19981;&#28982;&#22826;&#21487;&#24597;&#65292;
&#32780;&#21487;&#24597;&#30340;&#20107;&#24773;&#21364;&#27491;&#22312;&#19968;&#20214;&#20214;&#30340;&#21457;&#29983;&#12290;&lt;/p&gt;
&lt;p&gt;&lt;img alt="" src="/photo/2013-03-10-education/DSC_0245min.jpg" /&gt;&lt;/p&gt;
&lt;p&gt;2013/03/10 &#32461;&#20852;;&lt;/p&gt;</description><guid isPermaLink="true">http://localhost:8888/article/2013-03-10-education</guid><pubDate>Sun, 10 Mar 2013 21:25:00 GMT</pubDate></item><item><title>&#20991;&#30707;</title><link>http://localhost:8888/article/2013-02-28-dig-stone</link><description>&lt;p&gt;&#20302;&#30528;&#22836;&#65292;&#21162;&#21147;&#37325;&#22797;&#30528;&#21160;&#20316;&#65292;&#20182;&#24819;&#35201;&#20991;&#24320;&#36825;&#22359;&#30707;&#22836;&#12290;&lt;/p&gt;
&lt;p&gt;&#36825;&#24050;&#32463;&#26159;2013&#24180;&#30340;2&#26376;28&#26085;&#20102;&#65292;&#22905;&#30340;&#20449;&#36824;&#27809;&#26469;&#12290;&lt;/p&gt;
&lt;p&gt;&#21435;&#24180;&#30340;&#36825;&#20010;&#26102;&#20505;&#65292;&#26611;&#26465;&#36824;&#27809;&#25277;&#19997;&#65292;&#36814;&#26149;&#33457;&#36824;&#27809;&#24320;&#12290;&lt;/p&gt;
&lt;p&gt;&#26377;&#20123;&#29157;&#28909;&#65292;&#24050;&#25462;&#25171;&#20102;&#19968;&#20010;&#19978;&#21320;&#65292;&#22987;&#32456;&#19981;&#35265;&#36335;&#20154;&#12290;&lt;/p&gt;
&lt;p&gt;&#24448;&#24120;&#65292;&#20182;&#24635;&#35201;&#36215;&#26469;&#35753;&#36947;&#32473;&#36807;&#23458;&#65292;&#36215;&#36215;&#31449;&#31449;&#26102;&#38388;&#36807;&#24471;&#24555;&#12290;&lt;/p&gt;
&lt;p&gt;&#20063;&#19981;&#31105;&#21435;&#24819;&#20107;&#65292;&#19981;&#31105;&#21435;&#30475;&#26611;&#26465;&#65292;&#36814;&#26149;&#65292;&#30707;&#22836;&#20063;&#20991;&#24471;&#24555;&#12290;&lt;/p&gt;
&lt;p&gt;&#32461;&#20852; 2013.2.28&lt;/p&gt;</description><guid isPermaLink="true">http://localhost:8888/article/2013-02-28-dig-stone</guid><pubDate>Thu, 28 Feb 2013 21:25:00 GMT</pubDate></item><item><title>&#25105;&#20204;&#26377;&#26102;&#26377;&#20123;&#26408;&#40060;</title><link>http://localhost:8888/article/2012-12-17-we-are-silent</link><description>&lt;p&gt;&#22768;&#38899;&#21548;&#22810;&#20102;&#65292;&#24863;&#35273;&#21557;&#26434;&#65307;&lt;/p&gt;
&lt;p&gt;&#23631;&#24149;&#38754;&#20037;&#20102;&#65292;&#22352;&#19981;&#20303;&#24471;&#28902;&#65307;&lt;/p&gt;
&lt;p&gt;&#31361;&#28982;&#38745;&#19979;&#26469;&#65292;&#26377;&#20123;&#19981;&#20064;&#24815;&#65307;&lt;/p&gt;
&lt;p&gt;&#23396;&#23490;&#24471;&#35753;&#20154;&#19981;&#36866;&#65292;&#24635;&#35201;&#20123;&#27785;&#28024;&#30528;&#65307;&lt;/p&gt;
&lt;p&gt;&#26377;&#20123;&#24378;&#36843;&#30151;&#65292;&#20064;&#24815;&#30340;&#36712;&#36947;&#65292;&#35753;&#20154;&#23433;&#20840;&#65307;&lt;/p&gt;
&lt;p&gt;&#20037;&#36828;&#30340;&#20107;&#24773;&#65292;&#24635;&#22312;&#23490;&#23525;&#26102;&#22238;&#24819;&#65292;&lt;/p&gt;
&lt;p&gt;&#26080;&#35770;&#26159;&#28810;&#28895;&#65292;&#34623;&#34578;&#23567;&#36947;&#65292;&#21738;&#31687;&#35838;&#25991;&#65307;&lt;/p&gt;
&lt;p&gt;&#36824;&#26159;&#38632;&#28404;&#31572;&#30340;&#28165;&#26216;&#21021;&#37266;&#65292;&#21738;&#20010;&#22320;&#26041;&#65307;&lt;/p&gt;
&lt;p&gt;&#38388;&#38553;&#30340;&#22238;&#28335;&#65292;&#26412;&#28304;&#30340;&#23384;&#22312;&#65292;&#21364;&#22240;&#24537;&#30860;&#30340;&#36861;&#36880;&#65292;&#32780;&#26174;&#24471;&#38476;&#29983;&#12290;&lt;/p&gt;
&lt;p&gt;&#21364;&#19981;&#30693;&#65292;&#36861;&#36880;&#30340;&#23601;&#22312;&#25351;&#38388;&#12290;&lt;/p&gt;
&lt;p&gt;&#32461;&#20852; 2012.12.17&lt;/p&gt;</description><guid isPermaLink="true">http://localhost:8888/article/2012-12-17-we-are-silent</guid><pubDate>Mon, 17 Dec 2012 01:06:00 GMT</pubDate></item><item><title>&#25240;&#33150;&#21338;&#23458;&#23567;&#35760;</title><link>http://localhost:8888/article/2012-11-29-study-blog-record</link><description>&lt;p&gt;&#24930;&#24930;&#22320;&#23624;&#20174;&#20110;&#29616;&#23454;&#65292;&#20174;&#21407;&#20808;&#30340;&#22362;&#25345;&#21069;&#31471;HTML/CSS/JS&#65292;&#21518;&#31471;C++&#65292;&#25968;&#25454;&#24211;sqlite&#30340;&#33258;&#20027;&#24320;&#21457;&#23567;&#22411;&#21338;&#23458;&#30340;&#27169;&#24335;&#65292;
&#21040;&#29616;&#22312;&#30340;wordpress&#65292;&#33258;&#24049;&#21482;&#24320;&#21457;&#20027;&#39064;&#30340;&#24418;&#24335;&#65292;&#25343;&#26469;&#30340;&#20027;&#20041;&#32988;&#33510;&#28073;&#30340;&#29702;&#24819;&#20027;&#20041;&#65292;&#21482;&#22240;&#24352;&#22068;&#24052;&#35201;&#21507;&#39277;&#65292;&#19981;&#31649;&#24590;&#26679;&#65292;
&#26366;&#32463;&#29702;&#24819;&#36807;&#12290;&lt;/p&gt;
&lt;p&gt;&#33258;&#20027;&#24320;&#21457;&#21338;&#23458;&#65292;&#26242;&#19988;&#21483;&lt;a href="https://github.com/kzhiquan/blog-eyesee" target="_blank"&gt;eyesee&lt;/a&gt;&#21543;&#65292;
&#21482;&#26159;&#19968;&#20010;&#38607;&#24418;&#65292;&#26159;&#19968;&#20010;&#22522;&#20110;linux&#24179;&#21488;&#30340;epoll&#20107;&#20214;&#26426;&#21046;&#24320;&#21457;&#30340;&#65292;&#19968;&#20010;&#20027;&#32447;&#31243;&#23454;&#29616;&#32593;&#36335;&#25968;&#25454;&#30340;&#25910;&#21457;&#65292; HTTP&#21327;&#35758;&#35299;&#26512;&#65292;
&#21478;&#19968;&#20010;&#20027;&#32447;&#31243;&#23454;&#29616;&#20219;&#21153;&#30340;&#35843;&#24230;&#20998;&#37197;&#65292; &#20854;&#20182;&#32447;&#31243;&#27744;&#20013;&#30340;&#32447;&#31243;&#23454;&#29616;&#19994;&#21153;&#36923;&#36753;&#65292;&#19982;SQLITE&#25968;&#25454;&#24211;&#20132;&#20114;&#65292;JSON&#25968;&#25454;&#26684;&#24335;&#30340;&#36716;&#21270;&#31561;&#65307;
&#20854;&#20248;&#28857;&#26159;&#20855;&#26377;&#22810;&#27969;&#27700;&#32447;&#22788;&#29702;&#30340;&#27169;&#24335;&#65292;&#38750;&#24120;&#24555;&#36895;&#65292;&#19981;&#20250;&#38459;&#22622;&#65292;&#20195;&#30721;&#37327;&#23567;&#65292;&#37096;&#32626;&#26041;&#20415;&#12290;&#23384;&#22312;&#30340;&#32570;&#25022;&#26159;&#65292;&#22914;&#26524;&#29992;&#36827;&#31243;&#26469;&#22788;&#29702;&#32593;&#36335;&#25968;&#25454;&#30340;&#25910;&#21457;&#21644;&#20219;&#21153;&#30340;&#35843;&#24230;&#65292;
&#21017;&#31995;&#32479;&#26356;&#21152;&#31283;&#23450;&#65307;&#32447;&#31243;&#27744;&#26410;&#35774;&#35745;&#22909;&#65292;&#21482;&#23454;&#29616;&#20102;&#19968;&#20010;&#31616;&#21333;&#30340;&#23384;&#20648;&#32447;&#31243;&#23545;&#35937;&#30340;&#22320;&#26041;&#65292;&#24182;&#26410;&#23454;&#29616;&#37322;&#25918;&#65307;&#26080;&#38145;&#30340;&#28040;&#24687;&#38431;&#21015;&#26410;&#23454;&#29616;&#65292;
&#29305;&#21035;&#26159;&#31995;&#32479;&#23545;&#28040;&#24687;&#30340;&#22788;&#29702;&#26377;&#28857;&#20081;&#12290;&#32570;&#25022;&#24456;&#22810;&#65292;&#26412;&#26469;&#24819;&#23601;&#20570;&#19968;&#20214;&#20107;&#24773;&#65292;&#25226;&#23427;&#20570;&#22909;&#65292;&#25165;&#21435;&#24320;&#21457;&#36825;&#20010;&#30340;&#65292;&#20294;&#26159;&#19977;&#22235;&#20010;&#26376;&#36807;&#21435;&#20102;&#65292;
&#38607;&#24418;&#20986;&#26469;&#20102;&#65292;&#21518;&#38754;&#23601;&#33510;&#28073;&#20102;&#12290;&#19981;&#36807;&#65292;&#20063;&#26159;&#19968;&#31181;&#38203;&#28860;&#21543;&#65292;&#33258;&#25105;&#38463;Q&#19979;&#65292;&#28304;&#30721;&#20844;&#24320;&#20110;&lt;a href="https://github.com/kzhiquan/blog-eyesee" target="_blank"&gt;GITHUB&lt;/a&gt;&#65292;
&#27426;&#36814;&#22823;&#23478;&#25293;&#30742;&#12290;&lt;/p&gt;
&lt;p&gt;&#20851;&#20110;wordpress&#65292;&#26368;&#36817;&#33457;&#20102;&#28857;&#26102;&#38388;&#30475;&#20102;&#19979;&#23427;&#21069;&#31471;&#30340;&#28304;&#30721;&#65292;&#21021;&#19968;&#30475;&#65292;&#22826;&#24222;&#22823;&#20102;&#65292;&#33219;&#32959;&#21834;&#65292;
&#30475;&#30528;&#30475;&#30528;&#65292;&#30495;&#26377;&#31181;&#24819;&#27515;&#30340;&#24863;&#35273;&#65292;&#32467;&#26500;&#21270;&#31243;&#24207;&#35774;&#35745;&#20026;&#22522;&#30784;&#65292;&#32570;&#23569;&#25972;&#20307;&#19978;&#30340;&#38754;&#21521;&#23545;&#35937;&#35774;&#35745;&#65292;
&#34429;&#28982;&#29616;&#22312;PHP&#24320;&#22987;&#25903;&#25345;&#12289;&#24182;&#40723;&#21169;&#38754;&#21521;&#23545;&#35937;&#30340;&#35774;&#35745;&#39118;&#26684;&#20102;&#65292;&#20294;&#26159;PHP&#21382;&#21490;&#19978;&#23545;&#31867;&#26159;&#19981;&#25903;&#25345;&#30340;&#12290;
&#19981;&#36807;&#65292;&#27599;&#22825;&#22362;&#25345;&#19968;&#28857;&#28857;&#65292;&#30475;&#30528;&#30475;&#30528;&#65292;&#20063;&#23601;&#20064;&#24815;&#20102;&#65292;&#20174;&#21021;&#22987;&#21270;&#21442;&#25968;&#35774;&#32622;&#65292;&#21040;&#25968;&#25454;&#26597;&#35810;&#65292;&#21040;&#25968;&#25454;&#28210;&#26579;&#21040;&#21069;&#31471;&#30340;&#36807;&#31243;&#65292;
&#20854;&#20013;&#21253;&#25324;&#20027;&#39064;theme&#19979;&#27169;&#29256;&#30340;&#21152;&#36733;&#65292;wordpress&#30340;&#32531;&#23384;Cache&#26426;&#21046;&#65292;wordpress&#30340;&#22238;&#35843;&#20989;&#25968;&#26426;&#21046;(add_filter, apply_filter)&#65292;
wordpress&#30340;widgets&#26426;&#21046;(&#27880;&#20876;&#65292;&#35843;&#29992;)&#65292;wordpress&#30340;&#23618;&#32423;&#20803;&#32032;&#36941;&#21382;&#26426;&#21046;(walker, walker_page)&#31561;&#65292;&#24930;&#24930;&#25214;&#21040;&#20102;&#36335;&#32447;&#65292;
&#20294;&#26159;&#19968;&#24819;&#21040;&#21333;&#21333;&#35831;&#27714;&#36825;&#26679;&#19968;&#20010;&#39029;&#38754;&#65292;wordpress&#23601;&#35201;&#36208;&#23436;&#36825;&#26679;&#19968;&#20010;&#36807;&#31243;&#65292;&#20063;&#30495;&#22815;&#36763;&#33510;&#30340;&#65292;&#25928;&#29575;&#19978;&#32943;&#23450;&#26377;&#24433;&#21709;&#65292;&#34429;&#28982;&#26377;Cache&#30340;&#23384;&#22312;&#12290;
&#23545;&#20110;wordpress&#65292;&#19968;&#24320;&#22987;&#27604;&#36739;&#30097;&#24785;&#65306;&#31616;&#21333;&#30340;&#20869;&#23481;&#65292;&#24590;&#20040;&#26377;&#36825;&#20040;&#20016;&#23500;&#30340;&#34920;&#29616;&#24418;&#24335;&#12290;&#29616;&#22312;&#26377;&#28857;&#26126;&#30333;&#20102;&#65292;
&#20854;&#19968;&#65306;wordpress&#30340;&#25968;&#25454;&#26159;&#22266;&#23450;&#30340;&#65292;&#23450;&#21046;&#21270;&#20511;&#21161;style.css&#34920;&#29616;&#65292;&#36825;&#37324;&#35201;&#26681;&#25454;wordpress&#29983;&#25104;&#30340;class/ID&#26469;&#32534;&#21046;CSS&#35268;&#21017;&#65292;
&#25110;&#32773;&#33258;&#24049;&#22686;&#21152;class/ID&#28210;&#26579;&#65307;&#20854;&#20108;&#65306;&#22914;&#26524;&#24819;&#25913;&#21464;&#25968;&#25454;&#25110;&#32773;&#22686;&#21152;&#21151;&#33021;&#65292;&#24212;&#29992;&#25554;&#20214;&#26426;&#21046;&#65292;&#21363;add_filter/apply_filter&#12290;&#30446;&#21069;&#29702;&#35299;&#21040;&#36825;&#20010;&#27700;&#24179;&#12290;&lt;/p&gt;
&lt;p&gt;&#23454;&#36341;&#20102;&#19979;&#65292;&#32534;&#21046;&#20102;&#19968;&#20010;&#20027;&#39064;(&lt;a href="https://github.com/kzhiquan/wp-theme-eyeseenull"&gt;eyeseenul&lt;/a&gt;l)&#65292;
&#20063;&#36129;&#29486;&#21040;github&#19978;&#65292;&#23601;&#26159;&#24403;&#21069;&#36825;&#20010;&#21338;&#23458;&#20351;&#29992;&#30340;&#65292;&#38750;&#24120;&#30340;&#31616;&#21333;&#65292;&#23601;&#24403;&#32451;&#25163;&#20102;&#65292;&#21621;&#21621;&#12290;&lt;/p&gt;
&lt;p&gt;&#26412;&#26469;&#26159;&#19968;&#20010;&#32431;&#21518;&#31471;C/C++&#30340;&#32534;&#31243;&#32773;&#30340;&#65292;&#25509;&#35302;web&#24320;&#21457;&#65292;&#19968;&#24320;&#22987;&#21518;&#31471;&#20063;&#24819;&#37319;&#29992;C++/C&#65292;&#24182;&#19981;&#24819;&#28145;&#20837;&#25509;&#35302;Java/ASP/JSP&#30340;&#19996;&#35199;&#65292;
&#25506;&#23547;&#36807;Wt C++ webkit&#65292;&#24182;&#23454;&#36341;&#20102;&#19979;&lt;a href="https://github.com/kzhiquan/blog-eyesee" target="_blank"&gt;eyesee&lt;/a&gt;&#65292; 
&#20294;&#26159;&#21069;&#31471;&#37319;&#29992;JS&#20174;&#21518;&#21488;&#33719;&#21462;&#25968;&#25454;&#20877;&#26174;&#31034;&#65292;&#36825;&#26102;&#65292;&#29228;&#34411;&#25235;&#21462;&#19981;&#21040;&#25968;&#25454;&#65292;google&#23384;&#22312;&#25235;&#21462;AJAX&#30340;&#25968;&#25454;&#30340;&#26041;&#27861;&#65292;&#19981;&#36807;&#20063;&#19981;&#26159;&#21407;&#29983;&#30340;&#65292;&#19981;&#26159;&#33258;&#21160;&#20998;&#26512;&#35299;&#26512;&#39029;&#38754;&#19978;&#30340;javascript&#65292;
&#33258;&#21160;&#33719;&#21462;&#25968;&#25454;&#30340;&#65292;&#36825;&#21487;&#33021;&#26159;&#19979;&#19968;&#20195;&#29228;&#34411;&#21457;&#23637;&#30340;&#26041;&#21521;&#12290;&#21518;&#26469;&#20102;&#35299;&#20102;PHP&#65292;&#22240;&#20026;&#26159;&#24320;&#28304;&#30340;&#65292;&#20854;&#34394;&#25311;&#26426;Zend&#20063;&#26159;&#24320;&#28304;&#30340;&#65292;&#20294;&#26159;&#36890;&#36807;wordpress&#30340;&#28304;&#30721;&#30340;&#35299;&#35835;&#65292;
&#35273;&#24471;&#19981;&#22815;&#20248;&#38597;&#65292;&#20877;&#21518;&#26469;&#25509;&#35302;&#20102;node.js&#65292;&#20284;&#20046;&#25214;&#21040;&#20102;&#26041;&#21521;&#12290;&lt;/p&gt;
&lt;p&gt;&#30693;&#27849;/&#32461;&#20852;/2012.11.29&lt;/p&gt;</description><guid isPermaLink="true">http://localhost:8888/article/2012-11-29-study-blog-record</guid><pubDate>Thu, 29 Nov 2012 23:43:00 GMT</pubDate></item><item><title>&#25925;&#20065;&#26159;&#20160;&#20040;</title><link>http://localhost:8888/article/2012-11-27-what-is-the-hometown</link><description>&lt;p&gt;&#26376;&#26159;&#25925;&#20065;&#26126;&#12290;&lt;/p&gt;
&lt;p&gt;&#28165;&#20919;&#30340;&#26376;&#33394;&#65292;&#28165;&#20919;&#30340;&#24515;&#65292;&#19981;&#30693;&#25925;&#20065;&#30340;&#26376;&#26159;&#21542;&#28165;&#20919;&#65311;&lt;/p&gt;
&lt;p&gt;&#23681;&#26376;&#28418;&#27850;&#65292;&#19981;&#30693;&#20309;&#22788;&#25925;&#20065;&#65292;&#20294;&#25925;&#20065;&#21364;&#23588;&#29978;&#12290;&lt;/p&gt;
&lt;p&gt;&#26790;&#37324;&#35805;&#25925;&#20065;&#65292;&#21482;&#26159;&#27785;&#28096;&#30340;&#35760;&#24518;&#65292;&#24188;&#24180;&#30340;&#38236;&#20687;&#12290;&lt;/p&gt;
&lt;p&gt;&#32769;&#20102;&#65292;&#26080;&#22788;&#21487;&#20381;&#65292;&#21487;&#21542;&#20381;&#26087;&#26790;&#37324;&#35805;&#25925;&#20065;&#65292;&#32780;&#37027;&#26102;&#65292;&#22312;&#21738;&#37324;&#65311;&lt;/p&gt;
&lt;p&gt;&#24180;&#36731;&#26102;&#65292;&#24635;&#22312;&#25214;&#23547;&#65292;&#19968;&#20123;&#19981;&#30693;&#36947;&#30340;&#19996;&#35199;&#12290;&lt;/p&gt;
&lt;p&gt;&#21482;&#26159;&#22312;&#25214;&#65292; &#21482;&#26159;&#22312;&#20570;&#65292;&#38543;&#27874;&#36880;&#27969;&#65292;&#19968;&#36215;&#32769;&#21435;&#65292;&#28270;&#28781;&#22312;&#26102;&#20195;&#37324;&#12290;&lt;/p&gt;
&lt;p&gt;&#26080;&#27861;&#25239;&#25298;&#65292;&#21364;&#30041;&#19979;&#25925;&#20065;&#65292;&lt;/p&gt;
&lt;p&gt;&#26080;&#22788;&#38382;&#35759;&#65292;&#21482;&#33021;&#20208;&#22825;&#65292;&lt;/p&gt;
&lt;p&gt;&#26376;&#26159;&#25925;&#20065;&#26126;&#12290;&lt;/p&gt;
&lt;p&gt;&lt;img alt="" src="/photo/2012-11-27-what-is-the-hometown/DSC_0262min.jpg" /&gt;&lt;/p&gt;
&lt;p&gt;&#30693;&#27849;/&#32461;&#20852;/2012.11.27&lt;/p&gt;</description><guid isPermaLink="true">http://localhost:8888/article/2012-11-27-what-is-the-hometown</guid><pubDate>Tue, 27 Nov 2012 22:01:00 GMT</pubDate></item></channel></rss>